interface IChartPos {
  x: string;
  y: number;
}

interface IChartData {
  name: string;
  data: IChartPos[];
}

export const claims: IChartData[] = [
  {
    name: "Высокой",
    data: [
      {
        x: "2022-01-31",
        y: 5,
      },
      {
        x: "2022-02-01",
        y: 3,
      },
      {
        x: "2022-02-02",
        y: 4,
      },
      {
        x: "2022-02-03",
        y: 6,
      },
      {
        x: "2022-02-04",
        y: 2,
      },
    ],
  },
  {
    name: "Средней",
    data: [
      {
        x: "2022-01-31",
        y: 5,
      },
      {
        x: "2022-02-01",
        y: 7,
      },
      {
        x: "2022-02-02",
        y: 6,
      },
      {
        x: "2022-02-03",
        y: 2,
      },
      {
        x: "2022-02-04",
        y: 3,
      },
    ],
  },
  {
    name: "Невысокой",
    data: [
      {
        x: "2022-01-31",
        y: 9,
      },
      {
        x: "2022-02-01",
        y: 12,
      },
      {
        x: "2022-02-02",
        y: 10,
      },
      {
        x: "2022-02-03",
        y: 12,
      },
      {
        x: "2022-02-04",
        y: 15,
      },
    ],
  },
];
